%%问题一代码
clc
clear all
a1 = [10 12 5 7 0 25 9 6 8]';  %建立七种特效药的向量
a2 = [2 0 3 9 1 5 4 5 2]';
a3 = [14 12 11 25 2 35 17 16 12]';
a4 = [12 25 0 5 25 5 25 10 0]';
a5 = [20 35 5 15 5 35 2 10 2]';
a6 = [38 60 14 47 33 55 39 35 6]';
a7 = [100 55 0 35 6 50 25 10 20]';
A = [a1 a2 a3 a4 a5 a6 a7];
[A0, jb] = rref(A)  %求出A的行最简形和一组最大线性无关组
rank(A)

%%问题二代码
%秩为6, a4 a5 a6 a7一定存在，三种情况[a1 a2 a4 a5 a6 a7], 
% [a1 a3 a4 a5 a6 a7], [a2 a3 a4 a5 a6 a7]
B1 = [a1 a2 a4 a5 a6 a7];  %检测[a1 a2 a4 a5 a6 a7]
x1 = B1\a3

B2 = [a1 a3 a4 a5 a6 a7];  %检测[a1 a3 a4 a5 a6 a7]
x2 = B2\a2

B3 = [a2 a3 a4 a5 a6 a7];  %检测[a2 a3 a4 a5 a6 a7]
x3 = B3\a1
%选择[a1 a2 a4 a5 a6 a7]，只有该线性无关组表示其它向量的系数全为正
b1 = [40 62 14 44 53 50 71 41 14]';
y1 = [a1 a2 a4 a5 a6 a7]\b1
b2 = [162 141 27 102 60 155 118 68 52]';
y2 = [a1 a2 a4 a5 a6 a7]\b2
b3 = [88 67 8 51 7 80 38 21 30]';
y3 = [a1 a2 a4 a5 a6 a7]\b3
