% % %一、一维数据插值,美国人口
% % clc
% % clear all
% % t = 1900:10:1990;
% % p = [75.995  91.972  105.711  123.203  131.669...
% %      150.697  179.323  203.212  226.505  249.633];
% % interp1(t,p,1975) 
% % x = 1900:1:2000;
% % y = interp1(t,p,x,'spline');
% % 
% % plot(t,p,'o',x,y) 
% %  
% %  %二、二维数据插值，工资
% % years = 1950:10:1990;
% % service = 10:10:30;
% % wage = [150.697 199.592 187.625
% % 179.323 195.072 250.287
% % 203.212 179.092 322.767
% % 226.505 153.706 426.730
% % 249.633 120.281 598.243];
% % [X,Y] = meshgrid(service,years);%meshgrid是MATLAB中用于生成网格采样点的函数
% % w = interp2(X,Y,wage,15,1975)%interp2二维数据内插值函数
% 
%  %三、散点数据插值
% A=[-6 6 41.1;
%     -3 6 7.9;
%     3 6 20.7;
%     6 -6 41.1;
%     -6 3 40.5;
%     -3 3 42.8;
%     3 3 43;
%     6 3 43.1;
%     -6 -3 40.5;
%     -3 -3 42.3;
%     3 -3 41.9;
%     6 -3 44;
%     -6 -6 42.9;
%     -3 -6 42.1;
%     3 -6 42.2;
%     6 -6 42.6]
% x=A(:,1);y=A(:,2);z=A(:,3);
% scatter(x,y,120,z)%二维散点图
% % scatter3(x,y,z)%散点图
% % figure
% % [X,Y,Z]=griddata(x,y,z,linspace(min(x),max(x))',linspace(min(y),max(y)),'v4');
% % %MATLAB散乱点插值函数 griddata数据网格化
% % pcolor(X,Y,Z);shading interp%伪彩色图
% % figure,contourf(X,Y,Z)
% % %等高线图
% % figure,surf(X,Y,Z)%三维曲面
% % 
% 
%二维插值经典问题，海底构造图
x = [129.0 140.0 103.5 88.0 185.5 195.0 105.5 157.5 107.5 77.0 81.0 162.0 162.0 117.5];
y = [7.5 141.5 23.0 147.0 22.5 137.5 85.5 60.5 121.0 3.0 56.5 116.5 84.0 43.5];
Z = [4 8 6 8 6 8 8 9 9 8 8 9 4 9];%x,y为平面坐标，z为高度，要求绘制出精细的三维图形（需要对z插值）
plot(x,y,'o')  %画出海底平面构造
h = -Z;
xi = 70:1:200;yi=0:1:150;
figure
[X,Y] = meshgrid(xi,yi);  %画出网格图
H = griddata(x,y,h,X,Y,'cubic');  %插入二维或三维散点数据
mesh(X,Y,H);
plot3(X,Y,H,'o')  %绘制三维散点图，可以注释掉
view(-60,30);  %照相机视线，view(az,el) 为当前坐标区设置照相机视线的方位角和仰角。
  





