%第一步：画散点图：水塔出水的流速散点图
t=[0,0.921,1.843,2.949,3.871,4.978,5.900,7.006,7.928];
t=[t,10.954,12.032,12.954,13.875,14.982,15.903,16.826,17.931];
t=[t,19.037,19.959,23.880,24.968];
v=[55.38,40.13,38.88,36.88,36.13,33.62,34.36,34.71,38.50];
v=[v,70.50,74.84,70.58,61.43,62.98,58.51,56.11,55.15];
v=[v,59.65,56.82,50.63,44.47];
plot(t,v, 'r+')
xlabel('时间'); ylabel('流速');
legend('出水流速散点图')

%第二步：建模及模型对比
%方法一：拉格朗日插值
ti= linspace(0,24.968,200);
vi= itp1(t',v',ti);
plot(t,v,'r+', ti,vi);
legend('原始数据','插值数据')
%从图形来看，在右端确实出现了非常严重的振荡，振荡幅度达到了10^5 的级别，远远超出了数据点中流速的数值范围

%方法二：对数据做分段线性插值
ti= linspace(0,24.968,200);
vi= interp1(t,v,ti,'linear');
plot(t,v,'r+', ti,vi);
legend('原始数据','插值数据')
%虽然不是太光滑，但整体效果还行

%方法三：对数据做三次样条插值
ti= linspace(0,24.968,200);
vi= interp1(t,v,ti,'spline');
plot(t,v,'r+', ti,vi);
legend('原始数据','插值数据')
%曲线非常光滑，运行速度也很快，在几种插值中效果最好

%插值与拟合对比
t=[0,0.921,1.843,2.949,3.871,4.978,5.900,7.006,7.928];
t=[t,10.954,12.032,12.954,13.875,14.982,15.903,16.826,17.931];
t=[t,19.037,19.959,23.880,24.968];
v=[55.38,40.13,38.88,36.88,36.13,33.62,34.36,34.71,38.50];
v=[v,70.50,74.84,70.58,61.43,62.98,58.51,56.11,55.15];
v=[v,59.65,56.82,50.63,44.47];
pp= spline(t,v);
p6= polyfit(t,v,6);
ti= linspace(0,24.968,200);
plot(t,v,'r+', ti,ppval(pp,ti), ti,polyval(p6,ti),'g--')
legend('测量数据', '三次样条插值', '6阶多项式拟合')

%第三步：结果的检验与分析
%第一阶段：开始时刻0，体积2301；结束时刻8.967，体积1955；
%实际用水量：V1 = 2301-1955 = 346（立方米）
%估算用水量
ti= linspace(0,8.967,100);
vi= ppval(pp,ti);
S1= trapz(ti,vi)%梯形法求数值积分
vi= polyval(p6,ti);
F1= trapz(ti,vi)
%插值的估算用水量：S1= 340（立方米）
%拟合的估算用水量：F1= 353（立方米）

%第二段：开始时刻10.954，体积2573；结束时刻20.839，体积1955；
%实际用水量：V2 = 2573-1955 = 618（立方米）
%估算用水量
ti= linspace(10.954, 20.839,100);
vi= ppval(pp,ti);
S2= trapz(ti,vi)
vi= polyval(p6,ti);
F2= trapz(ti,vi)
%插值的估算用水量：S2= 612（立方米）
%拟合的估算用水量：F2= 606（立方米）

%第三段：开始时刻23.880，体积2518；结束时刻25.908，体积2421；
%实际用水量：V3 = 2518-2421 = 97（立方米）
ti= linspace(23.880, 25.908,50);
vi= ppval(pp,ti);
S3= trapz(ti,vi)
vi= polyval(p6,ti);
F3= trapz(ti,vi)
%插值的估算用水量：S3= 90（立方米）
%拟合的估算用水量：F3= 83（立方米）
%第四步：结果分析
%三次样条插值和6阶多项式拟合，实际效果都不错，三次样条插值更好一些；
%在三个时间段内，第二段效果最好，第三段效果最差，其原因应该与采集的数据量有关，
%第二段有11个采集数据，而第三段只有3个采集数据，数据量太少会导致误差增大。

%第五步：应用

%1.一天的用水量估计
%一天24小时内的用水量，可以通过插值函数和拟合函数的定积分分别获得
ti= linspace(0, 24, 200);
vi= ppval(pp,ti);
S= trapz(ti,vi)
vi= polyval(p6,ti);
F= trapz(ti,vi)
%插值估算一天用水量：S= 1238.7（立方米）
%拟合估算一天用水量：F= 1255.2（立方米）
%二者平均后一天用水量：1247（立方米）
%一天内的平均用水速度： 1247/24=52（立方米/小时）

%2.水泵灌水能力估计
%水泵灌水量 = 结束时塔内水量 – 开始时塔内水量 + 估算用水量
%第一供水段：开始时刻8.967，体积1955；结束时刻10.954，体积2573；
ti= linspace(8.967,10.954,100);
vi= ppval(pp,ti);
S1= trapz(ti,vi)
vi= polyval(p6,ti);
F1= trapz(ti,vi)
%插值的估算用水量：S1= 120（立方米）
%拟合的估算用水量：F1= 117（立方米）
%估算用水量平均：（120 + 117）/ 2 = 118.5（立方米）
%水泵灌水量：V1 = 2573 - 1955 + 118.5 = 736.5（立方米）
%第二供水段：开始时刻20.839，体积1955；结束时刻,23.880，体积2518；
ti= linspace(20.839,23.880,100);
vi= ppval(pp,ti);
S2= trapz(ti,vi)
vi= polyval(p6,ti);
F2= trapz(ti,vi)

%插值的估算用水量：S2= 161（立方米）
%拟合的估算用水量：F2= 173（立方米）
%估算用水量平均：（161 + 173）/ 2 = 167（立方米）
%水泵灌水量：V2 = 2518 - 1955 + 167 = 730（立方米）

%结果分析
%两个灌水阶段计算出来的灌水量相差不大，第一段736.5，第二段730，应该是合理的。
%面对一个实际问题，选用插值还是拟合，有时不容易确定。
%一般来讲，插值主要注重非测量点的数值，而拟合主要注重函数关系。

















