disp('可以更改的默认参数：R, M, C, L')
R = 100;  %默认参数100Ω
L = 1;  %默认参数0.01H
C = 1e-8;  %默认参数1μF
M = 0.01;  %默认参数0.01H，临界耦合数值
w0 = sqrt(1/(L*C))  %谐振频率
Q = w0*L/R  %谐振点的品质因素
coc = w0*M/R  %耦合系数设定
detu = '0.5*(w/1e4-1e4/w)'  %广义失谐量
a0_ = '1/(sqrt((1-(100*(w/1e4-1e4/w))^2+1^2)^2+4*(100*(w/1e4-1e4/w))^2))'  
a1_ = '1.5/(sqrt((1-(100*(w/1e4-1e4/w))^2+1.5^2)^2+4*(100*(w/1e4-1e4/w))^2))'  
a2_ = '3/(sqrt((1-(100*(w/1e4-1e4/w))^2+3^2)^2+4*(100*(w/1e4-1e4/w))^2))'  
a3_ = '0.5/(sqrt((1-(100*(w/1e4-1e4/w))^2+0.5^2)^2+4*(100*(w/1e4-1e4/w))^2))'
hold on
subplot(2,2,1)
ezplot(detu, a0_, [-2e4,2e4])  %coc=1时频率特性曲线
axis([-0.2,0.2,0,0.5]);
xlabel('广义失谐量')
ylabel('频率特性')
title('coc=1频率特性曲线')
subplot(2,2,2)
ezplot(detu, a1_, [-2e4,2e4])  %coc=1.5时频率特性曲线
axis([-0.2,0.2,0,0.5]);
xlabel('广义失谐量')
ylabel('频率特性')
title('coc=1.5频率特性曲线')
subplot(2,2,3)
ezplot(detu, a2_, [-2e4,2e4])  %coc=3时频率特性曲线
axis([-0.2,0.2,0,0.5]);
xlabel('广义失谐量')
ylabel('频率特性')
title('coc=3频率特性曲线')
subplot(2,2,4)
ezplot(detu, a3_, [-2e4,2e4])  %coc=0.5时频率特性曲线
axis([-0.2,0.2,0,0.5]);
xlabel('广义失谐量')
ylabel('频率特性')
title('coc=0.5频率特性曲线')
hold off
syms w1
[w1] = solve(abs(2*1/(sqrt((1-(100*(w1/1e4-1e4/w1))^2+1^2)^2+4*(100*(w1/1e4-1e4/w1))^2))) == 0.707,[w1])
format short(w1)